The Vehicle Distributors, a fictional wholesale distributor of die cast vehicle models, operates globally with customers in over 15 countries. The company has approached us with a dataset analysis task to help them make critical decisions regarding potential future expansion. The objective of this project is to address their inquiries and provide data-driven answers by examining the available data.

The provided dataset, along with its corresponding schema, can be found [here](https://www.mysqltutorial.org/mysql-sample-database.aspx).
The scale model cars database contains eight tables:

 - Customers: customer data
 - Employees: all employee information
 - Offices: sales office information
 - Orders: customers' sales orders
 - OrderDetails: sales order line for each sales order
 - Payments: customers' payment records
 - Products: a list of scale model cars
 - ProductLines: a list of product line categories */

### Install required dependencies

In [25]:
!pip install ipython-sql
!pip install mysqlclient

%load_ext sql

Requirement already satisfied: ipython-sql in c:\python311\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\python311\lib\site-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: ipython in c:\python311\lib\site-packages (from ipython-sql) (8.15.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\python311\lib\site-packages (from ipython-sql) (2.0.20)
Requirement already satisfied: sqlparse in c:\python311\lib\site-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in c:\python311\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\python311\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\python311\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.7.1)
Requirement already satisfied: greenlet!=0.4.17 in c:\python311\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: backcall in c:\python311\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\python311\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\python311\lib\site-packages (from ipython->ipython-sql) (0.19.0)
Requirement already satisfied: matplotlib-inline in c:\python311\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pickleshare in c:\python311\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in c:\python311\lib\site-packages (from ipython->ipython-sql) (3.0.39)
Requirement already satisfied: pygments>=2.4.0 in c:\python311\lib\site-packages (from ipython->ipython-sql) (2.16.1)
Requirement already satisfied: stack-data in c:\python311\lib\site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: traitlets>=5 in c:\python311\lib\site-packages (from ipython->ipython-sql) (5.10.0)
Requirement already satisfied: colorama in c:\python311\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\python311\lib\site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\python311\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: executing>=1.2.0 in c:\python311\lib\site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\python311\lib\site-packages (from stack-data->ipython->ipython-sql) (2.4.0)
Requirement already satisfied: pure-eval in c:\python311\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

[notice] A new release of pip is available: 23.2.1 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: mysqlclient in c:\python311\lib\site-packages (2.2.5)
The sql extension is already loaded. To reload it, use:
  %reload_ext sql

[notice] A new release of pip is available: 23.2.1 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

### Connect to database

In [26]:
%sql mysql://mysql:**************@localhost:3306/classicmodels

### Displaying the first five lines from the products table

In [27]:
%%sql
SELECT *
  FROM products
  LIMIT 5;

 * mysql://mysql:***@localhost:3306/classicmodels
5 rows affected.

[('S10_1678', '1969 Harley Davidson Ultimate Chopper', 'Motorcycles', '1:10', 'Min Lin Diecast', 'This replica features working kickstand, front suspension, gear-shift lever, footbrake lever, drive chain, wheels and steering. All parts are particularly delicate due to their precise scale and require special care and attention.', 7933, Decimal('48.81'), Decimal('95.70')),
 ('S10_1949', '1952 Alpine Renault 1300', 'Classic Cars', '1:10', 'Classic Metal Creations', 'Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.', 7305, Decimal('98.58'), Decimal('214.30')),
 ('S10_2016', '1996 Moto Guzzi 1100i', 'Motorcycles', '1:10', 'Highway 66 Mini Classics', 'Official Moto Guzzi logos and insignias, saddle bags located on side of motorcycle, detailed engine, working steering, working suspension, two leathe ... (93 characters truncated) ... paint with chrome accents, superior die-cast detail , rotating wheels , working kick stand, diecast metal with plastic parts and baked enamel finish.', 6625, Decimal('68.99'), Decimal('118.94')),
 ('S10_4698', '2003 Harley-Davidson Eagle Drag Bike', 'Motorcycles', '1:10', 'Red Start Diecast', 'Model features, official Harley Davidson logos and insignias, detachable rear wheelie bar, heavy diecast metal with resin parts, authentic multi-colo ... (199 characters truncated) ... t replica, baked enamel finish, 1:10 scale model, removable fender, seat and tank cover piece for displaying the superior detail of the v-twin engine', 5582, Decimal('91.02'), Decimal('193.66')),
 ('S10_4757', '1972 Alfa Romeo GTA', 'Classic Cars', '1:10', 'Motor City Art Classics', 'Features include: Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening trunk; opening doors; and detailed chassis.', 3252, Decimal('85.68'), Decimal('136.00'))]

### Count the number of lines in the product table

In [28]:
%%sql
SELECT COUNT(*) FROM products;

 * mysql://mysql:***@localhost:3306/classicmodels
1 rows affected.

[(110,)]

### Create a table that shows all available tables within the dataset

In [29]:
%%sql
SELECT 'customers', (SELECT COUNT(*) FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'customers') AS number_of_attributes, COUNT(*) AS number_of_rows
FROM customers

UNION ALL

SELECT 'employees', (SELECT COUNT(*) FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'employees'), COUNT(*)
FROM employees

UNION ALL

SELECT 'offices', (SELECT COUNT(*) FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'offices'), COUNT(*)
FROM offices

UNION ALL

SELECT 'productLines', (SELECT COUNT(*) FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'productlines'), COUNT(*)
FROM productlines

UNION ALL

SELECT 'products', (SELECT COUNT(*) FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'products'), COUNT(*) 
FROM products

UNION ALL

SELECT 'orderdetails', (SELECT COUNT(*) FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'orderdetails'), COUNT(*) 
FROM orderdetails

UNION ALL

SELECT 'orders', (SELECT COUNT(*) FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'orders'), COUNT(*)
FROM orders

UNION ALL

SELECT 'payments', (SELECT COUNT(*) FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'payments'), COUNT(*)
FROM payments;

 * mysql://mysql:***@localhost:3306/classicmodels
8 rows affected.

[('customers', 13, 122),
 ('employees', 8, 23),
 ('offices', 9, 7),
 ('productLines', 4, 7),
 ('products', 9, 110),
 ('orderdetails', 5, 2996),
 ('orders', 7, 326),
 ('payments', 4, 273)]

### Which products should we order more of or less off?
- The answer will depend of the low stock (i.e product in demand) and the product performance
- The rate of stock is the amount of products ordered divided by the quantity in stock
- The product performance is mainly the sum of the sales per product
- Priority for restocking: those with high product performance and low stock

In [30]:
%%sql
WITH
  low_stock AS (
    SELECT p.productCode, p.productName, ROUND((SUM(o.quantityOrdered)/p.quantityInStock),2) AS restock_rate
      FROM products p
      JOIN orderdetails o
      ON p.productCode = o.productCode
      GROUP BY p.productCode
      ORDER BY restock_rate DESC 
  ),
  performance_product AS (
    SELECT productCode, ROUND(SUM(quantityOrdered * priceEach),2) AS performance
      FROM orderdetails
      GROUP BY productCode
      ORDER BY performance DESC
  )							
SELECT l.productCode, l.productName, l.restock_rate, pp.performance
  FROM low_stock l
  JOIN performance_product pp
  ON l.productCode = pp.productCode
  WHERE l.productCode IN (SELECT productCode FROM performance_product)
  LIMIT 10;

 * mysql://mysql:***@localhost:3306/classicmodels
10 rows affected.

[('S18_3232', '1992 Ferrari 360 Spider red', Decimal('0.22'), Decimal('276839.98')),
 ('S12_1108', '2001 Ferrari Enzo', Decimal('0.28'), Decimal('190755.86')),
 ('S10_1949', '1952 Alpine Renault 1300', Decimal('0.13'), Decimal('190017.96')),
 ('S10_4698', '2003 Harley-Davidson Eagle Drag Bike', Decimal('0.18'), Decimal('170686.00')),
 ('S12_1099', '1968 Ford Mustang', Decimal('13.72'), Decimal('161531.48')),
 ('S12_3891', '1969 Ford Falcon', Decimal('0.92'), Decimal('152543.02')),
 ('S18_1662', '1980s Black Hawk Helicopter', Decimal('0.20'), Decimal('144959.91')),
 ('S18_2238', '1998 Chrysler Plymouth Prowler', Decimal('0.21'), Decimal('142530.63')),
 ('S18_1749', '1917 Grand Touring Sedan', Decimal('0.34'), Decimal('140535.60')),
 ('S12_2823', '2002 Suzuki XREO', Decimal('0.10'), Decimal('135767.03'))]

### Find the VIP customers and least engaged customers
Now we want to find the VIPs among our customers, those that bring in the most profit to the store and those that least engaged customers (bring the least amount of profit), so we can match the company's marketing strategy accordingly

#### Finding the customers that bring the most amount of profit

In [31]:
%%sql
WITH vips AS (
  SELECT o.customerNumber, SUM((od.priceEach-p.buyPrice)*quantityOrdered) AS profit_per_customer
    FROM orders o
    JOIN orderdetails od
    ON o.orderNumber = od.orderNumber
    JOIN products p
    ON od.productCode = p.productCode
    GROUP BY o.customerNumber	
    ORDER BY profit_per_customer DESC
)
SELECT c.contactLastName, c.contactFirstName, c.city, c.country, v.profit_per_customer
  FROM customers c
  JOIN vips v
  ON c.customerNumber = v.customerNumber
  ORDER BY profit_per_customer DESC
  LIMIT 5;

 * mysql://mysql:***@localhost:3306/classicmodels
5 rows affected.

[('Freyre', 'Diego ', 'Madrid', 'Spain', Decimal('326519.66')),
 ('Nelson', 'Susan', 'San Rafael', 'USA', Decimal('236769.39')),
 ('Young', 'Jeff', 'NYC', 'USA', Decimal('72370.09')),
 ('Ferguson', 'Peter', 'Melbourne', 'Australia', Decimal('70311.07')),
 ('Labrune', 'Janine ', 'Nantes', 'France', Decimal('60875.30'))]

#### Find the less Engaged customers

In [32]:
%%sql
WITH vips AS (
  SELECT o.customerNumber, SUM((od.priceEach-p.buyPrice)*quantityOrdered) AS profit_per_customer
    FROM orders o
    JOIN orderdetails od
    ON o.orderNumber = od.orderNumber
    JOIN products p
    ON od.productCode = p.productCode
    GROUP BY o.customerNumber	
    ORDER BY profit_per_customer DESC
)
SELECT c.contactLastName, c.contactFirstName, c.city, c.country, v.profit_per_customer
  FROM customers c
  JOIN vips v
  ON c.customerNumber = v.customerNumber
  ORDER BY profit_per_customer
  LIMIT 5;

 * mysql://mysql:***@localhost:3306/classicmodels
5 rows affected.

[('Young', 'Mary', 'Glendale', 'USA', Decimal('2610.87')),
 ('Taylor', 'Leslie', 'Brickhaven', 'USA', Decimal('6586.02')),
 ('Ricotti', 'Franco', 'Milan', 'Italy', Decimal('9532.93')),
 ('Schmitt', 'Carine ', 'Nantes', 'France', Decimal('10063.80')),
 ('Smith', 'Thomas ', 'London', 'UK', Decimal('10868.04'))]

### How much can we spend in acquiring new customers?
Let's calculate their LTV (Lifetime Value)

In [33]:
%%sql
WITH vips AS (
  SELECT o.customerNumber, SUM((od.priceEach-p.buyPrice)*quantityOrdered) AS profit_per_customer
  FROM orders o
  JOIN orderdetails od
  ON o.orderNumber = od.orderNumber
  JOIN products p
  ON od.productCode = p.productCode
  GROUP BY o.customerNumber	
  ORDER BY profit_per_customer DESC
)
SELECT SUM(profit_per_customer)/COUNT(DISTINCT(customerNumber)) AS average_profit
  FROM vips;

 * mysql://mysql:***@localhost:3306/classicmodels
1 rows affected.

[(Decimal('39039.594388'),)]

### Conclusion

Vintage cars and motorcycles are the priority for restocking. 
They sell frequently, and they are the highest-performance products.
However, from the classic cars. 1968 Ford Mustang is the highest performing car, outselling all other production lines as well.
Therefore, it would be advisable to include it as priiority for restocking.

Average profit tells us how much profit an average customer generates during their lifetime with our store. We can use it to predict our future profit.
So, if we get ten new customers next month, we'll earn 39,395 dollars, and we can decide based on this prediction how much we can spend on acquiring new customers.